nxp-mcuxpresso/mcux-soc-svd/KW43L43Z92/KW43L43Z92.xml
        <register>
          <name>ble_reg_txrx_pktend_qus_timestamp</name>
          <description>Quarter microsecond level timestamp</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pktend_timestamp_qus</name>
              <description>QUS level timestamp, This QUS timestamp is updated at tx or rx packet ends including normal tx/rx packet ends; hw/sw aborts and rx corrlation timeout.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_pktend_mcclock_timestamp</name>
          <description>Native clock timestamp</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>pktend_timestamp_clock</name>
              <description>Native clock value timestamp, Lower 28 bits are same as BTC native clock. Upper 4 bits are carry from BTC native clock wraps. This timestamp is updated at tx or rx packet ends including normal tx/rx packet ends; hw/sw aborts and rx corrlation timeout.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_err_inj_cntrl</name>
          <description>TxRx Error Injection Control</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>err_inj_en</name>
              <description>Software error injection enable, 0x0: disable error injection, 0x1: enable error injection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>err_inj_dir</name>
              <description>software error injection direction, 0x0: error injection on Tx side, 0x1: error injection on Rx side</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>err_inj_timer</name>
              <description>software error injection timer, Packet bit position (1;2;..N) to start error injection if err_inj_en is set. Tx bit error can be injected from preamble to crc; so position 1 is first preamble bit. Rx bit error can be injected from header to crc; so position 1 is first header bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dmem_crc_cor</name>
              <description>hardware Tx DMEM underflow CRC corruption enable, Enable CRC corruption at first 16-bit of Tx CRC if Tx DMEM underflow error interrupt is detected. Only valid when software controlled err_inj_en is zero. All the CRC bits transmitted will be inverted to cause CRC failure on the receiving device., 0x0: disable, 0x1: enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_aes_crc_cor</name>
              <description>hardware Tx AES underflow CRC corruption enable, Enable CRC corruption at first 16-bit of Tx CRC if Tx AES underflow error interrupt is detected. Only valid when software controlled err_inj_en is zero. All the CRC bits transmitted will be inverted to cause CRC failure on the receiving device., 0x0: disable, 0x1: enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_dma_crc_cor</name>
              <description>hardware Tx DMA CRC corruption enable, Enable CRC corruption at first 16-bit of Tx CRC if Tx DMA error interrupt is detected. Only valid when software controlled err_inj_en is zero. All the CRC bits transmitted will be inverted to cause CRC failure on the receiving device., 0x0: disable, 0x1: enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>err_inj_pattern</name>
              <description>16-Bit Error injection pattern, 0x0: do not flip the bit, 0x1: flip the bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_crc_corrupt</name>
          <description>TxRx CRC Corruption Control</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_dmem_crc_cor</name>
              <description>hardware Rx DMEM underflow CRC corruption enable, Set this enable to enable CRC corruption if Rx DMEM underflow error interrupt is detected. Only valid when software controlled err_inj_en is zero. The crc_success bit is flipped at the end of Rx., 0x0: disable, 0x1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_aes_crc_cor</name>
              <description>hardware Rx AES underflow CRC corruption enable, Set this enable to enable CRC corruption if Rx AES underflow error interrupt is detected. Only valid when software controlled err_inj_en is zero. The crc_success bit is flipped at the end of Rx, 0x0: disable, 0x1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_dma_crc_cor</name>
              <description>hardware Rx DMA CRC corruption enable, Set this enable to enable CRC corruption if Rx DMA error interrupt is detected. Only valid when software controlled err_inj_en is zero. The crc_success bit is flipped at the end of Rx., 0x0: disable, 0x1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rl_delay</name>
          <description>BLE Register Loader Delay Register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>coex_lock_delay</name>
              <description>Register Loader ALternate Start Address, Programmable delay in quarter microseconds after btu_bt_req assertion to MRC when Coex lock fail condition is checked in BTU. MRC samples TX power and TX/RX frequency value from BTU after sampling all bt_state serial information. This delay is used to give more time for first 8 bytes of RL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rl_start_addr_alt</name>
          <description>Register Loader Alternate Start Address</description>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rl_start_address_alt</name>
              <description>Register Loader ALternate Start Address, This points to the alternate start address of memory structure that ble_reg_ldr should fetch from. This pointer is the only used when RL_alt is 1. In alternating mode; every alternate Register Loading is done from this pointer. Only Bits 15:0 are used from this register. The upper 16-bits are reused from BLE_REG_RL_START_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rl_start_addr</name>
          <description>Register Loader Start Address</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rl_start_address</name>
              <description>Register Loader Start Address, This points to the start address of memory structure that ble_reg_ldr should fetch from.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rl_cntrl_sts</name>
          <description>Register Loader Control and Status</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>load_ccm</name>
              <description>Load CCM related memory content, For each new Connection Event; writing 1 will trigger BLE register loader to load only CCM related memory contents (memory offset = 0x20~44) to their BLE registers. This bit should be set along with load_non_ccm bit for packet events; to enable correct DBUS programming.This bit is self-cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>load_non_ccm</name>
              <description>Load non-CCM related memory content, For each new Connection Event; writing 1 will trigger BLE register loader to load non-CCM related memory contents (memory offset = 0x00~1C) to their BLE registers. This bit is self-cleared by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>auto_load_ccm</name>
              <description>Auto Load CCM related memory content, For each new Connection Event; writing 1 will trigger BLE register loader to load only CCM related memory contents (memory offset = 0x20~44) to their BLE registers at every start_rif_tx/start_rif_rx. This bit should be set along with auto_load_non_ccm bit for packet events; to enable correct DBUS programming. This bit is self-cleared by hardware.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>auto_load_non_ccm</name>
              <description>Auto Load non-CCM related memory content, For each new Connection Event; writing 1 will trigger BLE register loader to load non-CCM related memory contents (memory offset = 0x00~1C) to their BLE registers. This bit is self-cleared by hardware.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>rl_lock</name>
              <description>BLE Register Loader Lock bit, For each new Connection Event; rl_lock serves as Register Loader lock bit. It should be set along with load_ccm or load_non_ccm bit or before start_rif_tx/rx time if using auto_load_ccm or auto_load_non_ccm bits. It must remain set for the duration of packets that the Register Loader values are in effect. At the end of last packet; the rl_lock bit should be cleared by firmware. This bit is used to generate rx_lock_fail_intr or tx_lock_fail_intr.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_alt</name>
              <description>BLE Register Loader Alternate Mode Enable, Indicates which RL_START_ADDR is to be used., 0x0: Always use RL_START_ADDR., 0x1: Use Toggle mode where RL_START_ADDR and RL_START_ADDR_ALT are used for, alternating register loading.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_alt_reset</name>
              <description>BLE Register Loader Alternate Mode Reset, One-shot reset command to HW to use RL_START_ADDR pointer for the next register loading; regardless of which pointer was used in previous register loading. Self cleared by HW.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>coex_lock_bypass</name>
              <description>BLE Register Loader Coex Lock Bypass bit, Config bit to bypass coex lock fail detection on Register loader. Coex lock fail check can be bypassed by setting this bit to 1. This setting can be used if FW can pre-program the TX power and TX/RX frequency values in advance of a connection event without using register loader.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_ccm_done</name>
              <description>Done loading CCM memory, Register Loader has done loading CCM related memory content into their BLE registers., 0x0: Not done., 0x1: Done loading.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_non_ccm_done</name>
              <description>Done loading non-CCM memory, Register Loader has done loading non-CCM related memory content into their BLE registers., 0x0: Not done., 0x1: Done loading.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_busy</name>
              <description>Register Loader busy, Status indicating BLE Register Loader is busy. Asserted when fetching memory starts and de-asserted right after done writing to BLE registers., 0x0: Register Loader is idle., 0x1: Register Loader is busy.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_dma_err</name>
              <description>Register Loader Has DMA Error, Register Loader experienced DMA error., 0x0: No error, 0x1: SoC DMA slave has replied with ERROR response during Register Loader read, transfers.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_coex_done</name>
              <description>Coex Register Loading Done, Indicating Coex related register loading is done; i.e. the first 8 bytes of register loader., 0x0: Not done., 0x1: Done.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_dbus_done</name>
              <description>DBUS Register Loading Done, Indicating DBUS WDATA loading is done for the first 12 bytes of register loader., 0x0: Not done., 0x1: Done.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rl_at_curr</name>
              <description>Register Loader Alternate Pointer, Indicates which RL pointer is currently in use. When RL_alt = 0; this bit is always 0. when RL_alt = 1; this bit toggles for every register loading to indicate the Register Loader in use.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_dfe_pkt_extension_cntrl</name>
          <description>Tx/Rx Packet Extension Control, Control register to Data Field Extension after CRC for BLE location packet.</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_extn_pattern</name>
              <description>Tx Packet Extension Pattern, The value programmed in this bit reflects what will be sent out during the extension part of the Tx location packet. This value is also sent during the guard time at the beginning of the extension field., This bit is valid ONLY when tx_extn_en is set., 0x0: send 0000..., 0x1: send 1111...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>delay_extn_end</name>
              <description>Extension Packet Delay CDT, Define whether to delay CDT timer to start at packet estimated end time if extension field is corrupted due to antSwitchStatus (for example; BCA antenna is not honored) de-assertion; or due to BCA grant loss., If it is set; CDT timer needs to be delayed to the estimated end of extension filed time to line up the TIFS for next packet., If it is not set; for the same conditions; do not perform any CDT manipulation in hardware. This setting might cause BLE not to be able to Tx or Rx following the packet extension corruption., 0x0: do not perform any CDT manipulation in hardware, 0x1: delay CDT timer to the estimated end of extension</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_iq_sample_rate</name>
              <description>Rx IQ Sampling Rate, Define reception rate for IQ samples in extension field., 0x0: receive IQ sample every 4 usec, 0x1: receive IQ sample every 2 usec, 0x2: receive IQ sample every 1 usec, 0x3: not valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>extn_guard_time</name>
              <description>Extension Packet Guard Time, Define the guard interval between the CRC and extension supplementals in the unit of usec., 0x0: guard interval is 1 usec, 0x1: guard interval is 2 usec, 0x2: guard interval is 3 usec, 0x3: guard interval is 4 usec</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>extn_ref_ant_time</name>
              <description>Extension Reference Antenna IQ Sample Time, Define the reference antenna interval after the extension guard time and before switching antenna in the unit of usec. During this interval; IQ samples received is considered in the same of which the reference antenna is used., 0x0: reference antenna interval is 0 usec, 0x1: reference antenna interval is 2 usec, 0x2: reference antenna interval is 4 usec, 0x3: reference antenna interval is 8 usec</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_en</name>
              <description>Rx Packet Extension Enable, Enable bit of Rx extension packet., 0x0: disable to receive data extension, 0x1: enable to receive data extension</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_iq_sample_rate_rcv_override</name>
              <description>Rx Packet Extension IQ Sample Rate Override, When this is set and received packet is an AoD packet with extension field; IQ sample rate is derived from received supplemental type field of supplemental info byte; which is considered to override the software preset sample rate.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_sw_override_en</name>
              <description>Rx Extension Packet Software Override, Software enable bit to override rx_extn_rcv and rx_extn_length from Rx PDU header., 0x0: disable software override, 0x1: enable software override</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_sw_override_rcv</name>
              <description>Extension Packet Received Software Override, The value of rx_extn_rcv to which software overrides., This bit is used ONLY when rx_extn_sw_override_en bit is set.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_extn_sw_override_suppl_info</name>
              <description>Rx Extension Supplemental Info Byte Software Override, The value of rx_extn_length as of rx_extn_suppl_info[4:0] to which software overrides., The value of rx_extn_suppl_type as of rx_extn_suppl_info[7:6] to which software overrides., This length is used ONLY when rx_extn_sw_override_en bit is set.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
