nxp-mcuxpresso/mcux-soc-svd/KW43L43Z92/KW43L43Z92.xml
        <register>
          <name>ble_reg_aes_din_1</name>
          <description>Raw Data Input 1 for Software AES encryption</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_din</name>
              <description>Raw Data Input for AES Encryption ([63:32] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_din_2</name>
          <description>Raw Data Input 2 for Software AES encryption</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_din</name>
              <description>Raw Data Input for AES Encryption ([95:64] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_din_3</name>
          <description>Raw Data Input 3 for Software AES encryption</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_din</name>
              <description>Raw Data Input for AES Encryption ([127:96] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_dout_0</name>
          <description>AES Encrypted Data Output 0</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_dout</name>
              <description>AES Encrypted Data Output ([31:0] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_dout_1</name>
          <description>AES Encrypted Data Output 1</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_dout</name>
              <description>AES Encrypted Data Output ([63:32] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_dout_2</name>
          <description>AES Encrypted Data Output 2</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_dout</name>
              <description>AES Encrypted Data Output ([95:64] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_aes_dout_3</name>
          <description>AES Encrypted Data Output 3</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_aes_dout</name>
              <description>AES Encrypted Data Output ([127:96] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_mask_0</name>
          <description>BLE Interrupt Mask 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rt_err_intr</name>
              <description>rt_err_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt. The BLE_REG_RT_ERR_MASK should also be programmed to enable, desired event bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_5</name>
              <description>cdt_expiry_intr[5] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_4</name>
              <description>cdt_expiry_intr[4] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_3</name>
              <description>cdt_expiry_intr[3] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_2</name>
              <description>cdt_expiry_intr[2] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_1</name>
              <description>cdt_expiry_intr[1] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_0</name>
              <description>cdt_expiry_intr[0] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_3</name>
              <description>expiry_intr[3] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_2</name>
              <description>expiry_intr[2] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_1</name>
              <description>expiry_intr[1] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_0</name>
              <description>expiry_intr[0] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tmr_abort_intr</name>
              <description>tmr_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_abort_intr</name>
              <description>hw_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt. The BLE_REG_HW_ABORT_MASK should also be programmed to enable, desired event bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_abort_intr</name>
              <description>sw_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>rx_pkt_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_data_done_intr</name>
              <description>rx_data_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_ext_header_done_intr</name>
              <description>rx_adv_ext_header_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_resolve_done_intr</name>
              <description>irk_resolve_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_addr_done_intr</name>
              <description>rx_adv_addr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_hdr_done_intr</name>
              <description>rx_hdr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_hit_intr</name>
              <description>cor_hit_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>tx_pkt_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_data_done_intr</name>
              <description>tx_data_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_hdr_done_intr</name>
              <description>tx_hdr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_acc_done_intr</name>
              <description>tx_acc_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_mask_1</name>
          <description>BLE Interrupt Mask 0/1</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rt_err_intr</name>
              <description>rt_err_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt. The BLE_REG_RT_ERR_MASK should also be programmed to enable, desired event bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_5</name>
              <description>cdt_expiry_intr[5] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_4</name>
              <description>cdt_expiry_intr[4] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_3</name>
              <description>cdt_expiry_intr[3] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_2</name>
              <description>cdt_expiry_intr[2] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_1</name>
              <description>cdt_expiry_intr[1] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_0</name>
              <description>cdt_expiry_intr[0] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_3</name>
              <description>expiry_intr[3] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_2</name>
              <description>expiry_intr[2] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_1</name>
              <description>expiry_intr[1] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_0</name>
              <description>expiry_intr[0] interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tmr_abort_intr</name>
              <description>tmr_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_abort_intr</name>
              <description>hw_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt. The BLE_REG_HW_ABORT_MASK should also be programmed to enable, desired event bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_abort_intr</name>
              <description>sw_abort_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>rx_pkt_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_data_done_intr</name>
              <description>rx_data_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_ext_header_done_intr</name>
              <description>rx_adv_ext_header_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_resolve_done_intr</name>
              <description>irk_resolve_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_addr_done_intr</name>
              <description>rx_adv_addr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_hdr_done_intr</name>
              <description>rx_hdr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_hit_intr</name>
              <description>cor_hit_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>tx_pkt_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_data_done_intr</name>
              <description>tx_data_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_hdr_done_intr</name>
              <description>tx_hdr_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_acc_done_intr</name>
              <description>tx_acc_done_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
