nxp-mcuxpresso/mcux-soc-svd/KW43L43Z92/KW43L43Z92.xml
        <register>
          <name>MDA_W0_2_ANTIPOL_DFMT1</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xC40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_ANTIPOL</name>
              <description>Anti-pol Privileged attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to privileged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to user.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_3_ANTIPOL_DFMT1</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xC60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_ANTIPOL</name>
              <description>Anti-pol Privileged attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to privileged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to user.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_4_ANTIPOL_DFMT1</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xC80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_ANTIPOL</name>
              <description>Anti-pol Privileged attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to privileged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to user.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_5_ANTIPOL_DFMT1</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xCA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_ANTIPOL</name>
              <description>Anti-pol Privileged attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to privileged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to user.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_6_ANTIPOL_DFMT0</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xCC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRC1</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC0</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_7_ANTIPOL_DFMT1</name>
          <description>DAC Master Domain Assignment Anti-pol Register</description>
          <addressOffset>0xCE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID_ANTIPOL</name>
              <description>Anti-pol Domain identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_ANTIPOL</name>
              <description>Anti-pol Privileged attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's privileged/user attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to privileged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to user.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA_ANTIPOL</name>
              <description>Anti-pol Secure attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>three</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two</name>
                  <description>Use the bus master's secure/nonsecure attribute directly.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Force the bus attribute for this master to nonsecure.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Force the bus attribute for this master to secure.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK3</name>
              <description>1-bit Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Register can be written by any secure privileged write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Register is locked (read-only) until the next reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBC0_MEM0_GLBCFG</name>
          <description>MBC Global Configuration Register</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xC0005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NBLKS</name>
              <description>Number of blocks in this memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SIZE_LOG2</name>
              <description>Log2 size per block</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
