nxp-mcuxpresso/mcux-soc-svd/KW43L43Z92/KW43L43Z92.xml
        <register>
          <name>GPCHR</name>
          <description>Global Pin Control High</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPWD</name>
              <description>Global Pin Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPWE16</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE17</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE18</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE19</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE20</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE21</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE22</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE23</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE24</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE25</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE26</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE27</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE28</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE29</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE30</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE31</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Port Voltage Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>range0</name>
                  <description>1.71 V-3.6 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>range1</name>
                  <description>2.70 V-3.6 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR0</name>
          <description>Pin Control 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Pull Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ps0</name>
                  <description>Enables internal pulldown resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ps1</name>
                  <description>Enables internal pullup resistor</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Pull Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pe0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pe1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PV</name>
              <description>Pull Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pv0</name>
                  <description>Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pv1</name>
                  <description>High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFE</name>
              <description>Passive Filter Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pfe0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pfe1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE</name>
              <description>Open Drain Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ode0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ode1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX</name>
              <description>Pin Multiplex Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mux0</name>
                  <description>Pin disabled (analog)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux1</name>
                  <description>Alternative 1 (GPIO)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux10</name>
                  <description>Alternative 2 (chip-specific)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mux11</name>
                  <description>Alternative 3 (chip-specific)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lk0</name>
                  <description>Does not lock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lk1</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
